rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'abc'
---
  def sameDirector

    @themovie = Movie.find(params[:id])
    @thevalue = @themovie[:director]
    if(@thevalue!='')

      @movies =  Movie.where(:director => @thevalue)